app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT 1  [["name", "Room"]]
---
  def create
    @room = Room.find_by(name: room_params[:name])