app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    @room.users << User.find(room_params[:owner_id])

    if @room.save
      render json: @room.to_json(include: :users), status: :ok
    else
      render json: {error: @room.errors.full_messages.first}, status: :unprocessable_entity
---
INSERT INTO "rooms" ("name", "socket_id", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Room"], ["socket_id", "123456789"], ["owner_id", 1], ["created_at", "2016-04-21 15:09:57.492412"], ["updated_at", "2016-04-21 15:09:57.492412"]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."room_id" = $1  [["room_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_rooms" ON "users"."id" = "user_rooms"."user_id" WHERE "user_rooms"."room_id" = $1  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"