app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Test2"]]
INSERT INTO "users" ("name", "socket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["socket_id", "123456789"], ["created_at", "2016-04-21 14:03:12.089768"], ["updated_at", "2016-04-21 14:03:12.089768"]]
SELECT "rooms".* FROM "rooms" INNER JOIN "user_rooms" ON "user_rooms"."room_id" = "rooms"."id" WHERE (user_rooms.user_id = 5 OR rooms.owner_id = 5)
---
  def create
    @user = User.find_by(name: user_params[:name])
    @users = User.where.not(name: user_params[:name])

    if @user.nil?
      p 'creating user'
      @user = User.new(user_params)
      if @user.save
        render json: {users: @users, rooms: []}
      else
        render json: {errors: @user.errors, status: :unprocessable_entity}
      end
    else
      p 'user exists'
      @rooms = Room.joins(:user_rooms).where("user_rooms.user_id = ? OR rooms.owner_id = ?", @user.id, @user.id)

UPDATE "users" SET "socket_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["socket_id", "123456111"], ["updated_at", "2016-04-21 14:03:33.092442"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)